
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=2280426106182959632]
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=8509530227199128232]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z00493513SFYX7KIRT3B6]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=prod-sdk-analyzed]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-queue-deadletter]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_upload]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-e0fc5ec1]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=prod-sdk-analysis]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-95c232e8]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:245339368379:certificate/6354ca50-99dc-4b91-a815-c1f3ca723df9]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-026fcb64]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-1b3c4b56]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio.com]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-prod-server-access-logs]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=prod-sdk_analysis-execution-task-role]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_analysis]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=214502239573706553]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=EQU24OD7P9BYZ]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=8018605442060636623]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_MX]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6__github-challenge-curibio.www.curibio.com_TXT]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_TXT]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_A]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio.com"]: Refreshing state... [id=Z00493513SFYX7KIRT3B6__cf8a73a02ed777d265f1e560422d8381.curibio.com._CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z00493513SFYX7KIRT3B6_a6a6hxwse7f7keb3h845_CNAME]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z00493513SFYX7KIRT3B6_www_CNAME]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=2987157791685770596]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=prod-sdk_analysis-execution-task-role-20210908162419459500000001]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_jupyter-sdk.curibio.com_CNAME]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=412358223870055198]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-17 15:56:52 +0000 UTC]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio.com]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=prod-sdk_analysis-ecs_task_role]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=prod-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=prod-sdk_analysis-ecs-task-definition]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1OSG2PRSZKP4F]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_downloads.curibio.com_CNAME]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.jupyter_notebook[0].aws_s3_bucket.jupyter will be updated in-place
  ~ resource "aws_s3_bucket" "jupyter" {
        id                          = "jupyter-sdk.curibio.com"
        tags                        = {}
        # (12 unchanged attributes hidden)


      ~ website {
          ~ routing_rules  = jsonencode(
              ~ [
                  ~ {
                      ~ Redirect = {
                          ~ ReplaceKeyWith   = "v2/gh/curibio/jupyter_sdk/v0.16.1?filepath=intro.ipynb" -> "v2/gh/curibio/jupyter_sdk/v0.16.2?filepath=intro.ipynb"
                            # (2 unchanged elements hidden)
                        }
                    },
                ]
            )
            # (2 unchanged attributes hidden)
        }
        # (1 unchanged block hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "prod-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:1"
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-026fcb64",
              + "subnet-1b3c4b56",
              + "subnet-e0fc5ec1",
            ]
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.


```

</details>

Pusher: @jperson